In [1]:
import pandas as pd

In [2]:
ds=pd.read_csv('Social_Network_Ads.csv')

In [3]:
ds

      User ID  Gender  Age  EstimatedSalary  Purchased
0    15624510    Male   19            19000          0
1    15810944    Male   35            20000          0
2    15668575  Female   26            43000          0
3    15603246  Female   27            57000          0
4    15804002    Male   19            76000          0
..        ...     ...  ...              ...        ...
395  15691863  Female   46            41000          1
396  15706071    Male   51            23000          1
397  15654296  Female   50            20000          1
398  15755018    Male   36            33000          0
399  15594041  Female   49            36000          1

[400 rows x 5 columns]

In [6]:
ds.isnull().sum()

User ID            0
Gender             0
Age                0
EstimatedSalary    0
Purchased          0
dtype: int64

In [7]:
def gender(x):
    if x=="Male":
        return 0
    else:
        return 1
ds['Gender']=ds['Gender'].apply(gender)

In [8]:
ds

      User ID  Gender  Age  EstimatedSalary  Purchased
0    15624510       0   19            19000          0
1    15810944       0   35            20000          0
2    15668575       1   26            43000          0
3    15603246       1   27            57000          0
4    15804002       0   19            76000          0
..        ...     ...  ...              ...        ...
395  15691863       1   46            41000          1
396  15706071       0   51            23000          1
397  15654296       1   50            20000          1
398  15755018       0   36            33000          0
399  15594041       1   49            36000          1

[400 rows x 5 columns]

In [19]:

col = list(X.columns)
X=ds.drop(['User ID','Purchased'],axis=1)
y=ds['Purchased']

0      0
1      0
2      0
3      0
4      0
      ..
395    1
396    1
397    1
398    0
399    1
Name: Purchased, Length: 400, dtype: int64

In [20]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(X, y, test_size=0.2)

In [21]:
from sklearn.linear_model import LogisticRegression
logisticRegr = LogisticRegression()
logisticRegr.fit(x_train, y_train)

LogisticRegression()

In [33]:
predictions = logisticRegr.predict(x_test)
score = logisticRegr.score(x_test, y_test)
print(score)
#accuracy

0.65

In [24]:
from sklearn import metrics

In [26]:
tn, fp, fn, tp = metrics.confusion_matrix(y_test, predictions).ravel()
(tn, fp, fn, tp)

(52, 0, 28, 0)

In [29]:
precision = tp/(tp+fp)
precision

C:\Users\HI\AppData\Local\Temp/ipykernel_11912/1183463474.py:1: RuntimeWarning: invalid value encountered in longlong_scalars
  precision = tp/(tp+fp)

nan

In [30]:
recall = tp/(tp+fn)
recall

0.0

In [34]:

accuracy = metrics.accuracy_score(y_test, predictions) # accuracy
error_rate = 1 - accuracy

In [35]:
error_rate

0.35